cf/Catalogs/FullPathsToForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>FullPathsToForms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FullFormPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/InformationReferencesForForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>InformationReferencesForForms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RelevantFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FromConfiguration</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RelevantTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullFormPath</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FullPathsToForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/InformationCenterServerCached/Ext/Module.bsl
#Region Internal

// Returns a table of external links for the given forms.
//
// Parameters:
//	HashPathToForm - String - Hash the full path to a form.
//
// Returns:
//	ValueTable - Table of information references for the form with the following columns:
//	* Description - String - External link name.
//	* Address - String - External link address.
//	* Weight - Number - External link weight.
//	* RelevantFrom - Date - Start date of the external link lifetime.
//	* RelevantTo - Date - End date of the external link lifetime.
//	* ToolTip - String - External link tooltip.
//
Function InformationReferences(HashPathToForm) Export
	
	Query = New Query;
	Query.SetParameter("Hash", HashPathToForm);
	Query.SetParameter("CurrentDate", CurrentSessionDate());
	Query.Text = 
	"SELECT
	|	FullPathsToForms.Ref AS Ref
	|INTO PathsToForms
	|FROM
	|	Catalog.FullPathsToForms AS FullPathsToForms
	|WHERE
	|	FullPathsToForms.Hash = &Hash
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	InformationReferencesForForms.Description AS Description,
	|	InformationReferencesForForms.Address AS Address,
	|	InformationReferencesForForms.Weight AS Weight,
	|	InformationReferencesForForms.RelevantFrom AS RelevantFrom,
	|	InformationReferencesForForms.RelevantTo AS RelevantTo,
	|	InformationReferencesForForms.ToolTip AS ToolTip
	|FROM
	|	PathsToForms AS PathsToForms
	|		INNER JOIN Catalog.InformationReferencesForForms AS InformationReferencesForForms
	|		ON PathsToForms.Ref = InformationReferencesForForms.FullFormPath
	|WHERE
	|	InformationReferencesForForms.RelevantFrom <= &CurrentDate
	|	AND InformationReferencesForForms.RelevantTo >= &CurrentDate
	|
	|ORDER BY
	|	Weight DESC";
	
	Return Query.Execute().Unload();
	
EndFunction

#EndRegion
